/************************************************************************
* 版权所有 (C)2001, 深圳市昊一源科技有限公司
* 
* 文件名称: 
* 文件标识: 
* 内容摘要: 
* 其它说明: 
* 当前版本:			V1.0.0.0     
* 作     者:		lzh
* 完成日期:  	  	2020/06/16
* 
* 修改记录1:  
*    修改日期:     2019/05/20
*    版 本 号:    V1.0.0.0
*    修 改 人:    XXXX
*    修改内容:  
* 修改记录2: …
************************************************************************/
#ifndef __HL_HAL_UART_H__
#define __HL_HAL_UART_H__

#include "rtthread.h"
#include "stdint.h"
#include "stdbool.h"

/**************************************************************************
 *                               宏定义                                      *
 **************************************************************************/

//

/**************************************************************************
 *                              数据类型                                      *
 **************************************************************************/
// 回调函数类型
typedef void (*uart_rcv_cb_t)(uint8_t);

// 串口枚举
typedef enum _UART_PORT_E
{
    UART_PORT1 = 1,
    UART_PORT2,
    UART_PORT3,
    LPUART_PORT,
} UART_PORT_E;

/**************************************************************************
 *                                常量                                      *
 **************************************************************************/

//

/**************************************************************************
 *                            全局变量声明                                      *
 **************************************************************************/

//

/**************************************************************************
 *                            全局函数原型                                      *
 **************************************************************************/
/* 注册回调函数 */
bool hl_hal_uart_receive_reg(UART_PORT_E USARTx, uart_rcv_cb_t rcv_cb_handle);

/* 配置串口 */
bool hl_hal_uart_init(UART_PORT_E USARTx, uint32_t baudrate);

/* 串口去初始化 */
bool hl_hal_uart_deinit(UART_PORT_E USARTx);

/* 串口发送数据 */
bool hl_hal_uart_send(UART_PORT_E USARTx, uint8_t* p_data, uint16_t size);

#endif /* end of #ifndef __HL_HAL_UART_H__ */
